/**
  **********************************  STM8S  ***********************************
  * @文件名     ： bsp_timer.c
  * @作者       ： strongerHuang
  * @库版本     ： V2.2.0
  * @文件版本   ： V1.0.0
  * @日期       ： 2017年04月10日
  * @摘要       ： TIM定时器源文件
  ******************************************************************************/
/*----------------------------------------------------------------------------
  更新日志:
  2017-04-10 V1.0.0:初始版本
  ----------------------------------------------------------------------------*/
/* 包含的头文件 --------------------------------------------------------------*/
#include "bsp_timer.h"


/* 全局变量 ------------------------------------------------------------------*/
uint16_t gTIMTiming_Num;                         //定时计数
uint8_t  gTIMTiming_Flag = 0;                    //定时标志(0-无效 1-有效)


/************************************************
函数名称 ： TIMER_Initializes
功    能 ： 定时器初始化
参    数 ： 无
返 回 值 ： 无
作    者 ： strongerHuang
*************************************************/
void TIMER_Initializes(void)
{
  TIM4_TimeBaseInit(TIM4_PRESCALER_128, 125-1);  //定时1ms (16M/128/125 = 1000)
  TIM4_ClearFlag(TIM4_FLAG_UPDATE);              //清除标志位

  TIM4_ITConfig(TIM4_IT_UPDATE, ENABLE);         //使能更新UPDATE中断
  enableInterrupts();                            //使能全局中断
}

/************************************************
函数名称 ： TIMTiming_Nms
功    能 ： 定时Nms
参    数 ： Times --- N值
返 回 值 ： 无
作    者 ： strongerHuang
*************************************************/
void TIMTiming_Nms(uint16_t Times)
{
  gTIMTiming_Num = Times;                        //定时Nms
  gTIMTiming_Flag = 0;                           //清零标志

  TIM4_SetCounter(0);                            //计数值归零
  TIM4_Cmd(ENABLE);                              //启动定时器
}

/************************************************
函数名称 ： TIMTiming_Off
功    能 ： 关闭定时
参    数 ： 无
返 回 值 ： 无
作    者 ： strongerHuang
*************************************************/
void TIMTiming_Off(void)
{
  gTIMTiming_Flag = 0;
  TIM4_Cmd(DISABLE);                             //关闭定时器
}


/**** Copyright (C)2017 strongerHuang. All Rights Reserved **** END OF FILE ****/
